# SQLite

In [1]:
import sqlite3

# sqlite 데이터베이스 연결하기
dbPath = "../Data/test.sqlite"
conn = sqlite3.connect(dbPath)

# 테이블을 생성하고 데이터 넣기
curs = conn.cursor()
curs.executescript(
    """
    DROP TABLE IF EXISTS items;
    CREATE TABLE items(
        item_id INTEGER PRIMARY KEY AUTOINCREMENT,
        name TEXT UNIQUE,
        price INTEGER
    );

    INSERT INTO items(name, price) VALUES ('Apple', 800);
    INSERT INTO items(name, price) VALUES ('Orange', 780);
    INSERT INTO items(name, price) VALUES ('Banana', 430);
    """
)

# 위의 스크립트를 반영하려면
conn.commit()

In [8]:
# 데이터 추출하기
curs = conn.cursor()
curs.execute("select * from items")
item_list = curs.fetchall()

print(item_list)

[(1, 'Apple', 800), (2, 'Orange', 780), (3, 'Banana', 430), (4, '사과', 5200), (5, '오렌지', 15200), (6, 'Mango', 7700), (7, 'Kiwi', 4000), (8, 'Grape', 8700)]

In [5]:
# 데이터 추가하기
curs = conn.cursor()
curs.execute(
    'insert into items (name, price) values (?, ?)', ('오렌지', 15200)
)
conn.commit()

In [7]:
# 여러 데이터 연속으로 넣기
curs = conn.cursor()
data = [('Mango', 7700),('Kiwi', 4000),('Grape', 8700)]
curs.executemany("insert into items (name, price) values (?,?)", data)
conn.commit()

In [9]:
# 4000원 ~ 7000원 사이의 데이터 추출하기
curs = conn.cursor()
price_range = [4000, 7000]
curs.execute("select * from items where price between ? and ?",price_range)
item_list = curs.fetchall()

for it in item_list:
    print(it)

(4, '사과', 5200)
(7, 'Kiwi', 4000)

---
# MySQL

In [2]:
!pip install pymysql

Requirement already satisfied: pymysql in /opt/anaconda3/lib/python3.12/site-packages (1.1.1)

In [3]:
import pymysql as mysql

In [4]:
# MySQL Connection
conn = mysql.connect(
    host='127.0.0.1',
    user='root',
    password='qwer1234',
    db='education',
    charset='utf8'
)

# Connection으로 부터 Cursor 생성
curs = conn.cursor()

NameError: name 'mysql' is not defined

In [5]:
# SQL 문장
sql = 'select * from student'
curs.execute(sql)

rows = curs.fetchall()
print(rows)

conn.close()

(('a001', 'james', 'math', '2222', 'LA'), ('b002', '관우', '심리학과', '010-222', '서울'), ('b003', '장비', '경제학과', '010-333', '서울'), ('c001', '조조', '국문학과', '016-111', '경기'), ('c002', '여포', '심리학과', '016-222', '경기'), ('c003', '손견', '경제학과', '016-333', '경기'), ('d001', '홍길동', '수학과', '017-111', '광주'), ('S001', '박송명', '컴퓨터공학과', '123-4567', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '국문학과', '890-5678', None), ('S006', '황정숙', '사학과', '678-9012', None))

In [6]:
rowList = list(rows)
rowList

[('a001', 'james', 'math', '2222', 'LA'),
 ('b002', '관우', '심리학과', '010-222', '서울'),
 ('b003', '장비', '경제학과', '010-333', '서울'),
 ('c001', '조조', '국문학과', '016-111', '경기'),
 ('c002', '여포', '심리학과', '016-222', '경기'),
 ('c003', '손견', '경제학과', '016-333', '경기'),
 ('d001', '홍길동', '수학과', '017-111', '광주'),
 ('S001', '박송명', '컴퓨터공학과', '123-4567', None),
 ('S002', '최민국', '컴퓨터공학과', '234-5678', None),
 ('S003', '이승호', '국문학과', '345-6789', None),
 ('S004', '정수봉', '국문학과', '456-7890', None),
 ('S005', '김상진', '국문학과', '890-5678', None),
 ('S006', '황정숙', '사학과', '678-9012', None)]

In [10]:
print(rowList[7])
print(rowList[7][1])

('S001', '박송명', '컴퓨터공학과', '123-4567', None)
박송명

---
### Insert Data #1

In [11]:
# MySQL Connection
conn = mysql.connect(
    host='127.0.0.1',
    user='root',
    password='qwer1234',
    db='education',
    charset='utf8'
)

# Connection으로 부터 Cursor 생성
curs = conn.cursor()

In [12]:
# sql 문장
sql = "insert into student(scode, sname, sdept, sphone, saddress) values (%s, %s, %s, %s, %s)"

In [13]:
curs.execute(sql,('b001', '유비', '국문학과', '010-111', '서울'))
curs.execute(sql,('b002', '관우', '국문학과', '010-111', '서울'))
curs.execute(sql,('b003', '장비', '국문학과', '010-111', '서울'))

conn.commit()

In [14]:
# SQL 문장
sql = 'select * from student'
curs.execute(sql)

rows = curs.fetchall()
print(rows)

conn.close()

(('a001', 'james', 'math', '2222', 'LA'), ('b001', '유비', '국문학과', '010-111', '서울'), ('b002', '관우', '국문학과', '010-111', '서울'), ('b003', '장비', '국문학과', '010-111', '서울'), ('c001', '조조', '국문학과', '016-111', '경기'), ('c002', '여포', '심리학과', '016-222', '경기'), ('c003', '손견', '경제학과', '016-333', '경기'), ('d001', '홍길동', '수학과', '017-111', '광주'), ('S001', '박송명', '컴퓨터공학과', '123-4567', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '국문학과', '890-5678', None), ('S006', '황정숙', '사학과', '678-9012', None))

---
# Insert Data #2

In [15]:
# MySQL Connection
conn = mysql.connect(
    host='127.0.0.1',
    user='root',
    password='qwer1234',
    db='education',
    charset='utf8'
)

# Connection으로 부터 Cursor 생성
curs = conn.cursor()

In [18]:
data = (
    ('c001', '조조', '국문학과', '016-111', '경기'),
    ('c002', '여포', '심리학과', '016-222', '경기'),
    ('c003', '동탁', '경제학과', '016-333', '경기')
)

In [19]:
# sql 문장
sql = "insert into student(scode, sname, sdept, sphone, saddress) values (%s, %s, %s, %s, %s)"

In [20]:
# Insert 실행
curs.executemany(sql, data)
conn.commit()

In [21]:
# SQL 문장
sql = 'select * from student'
curs.execute(sql)

rows = curs.fetchall()
print(rows)

conn.close()

(('a001', 'james', 'math', '2222', 'LA'), ('b001', '유비', '국문학과', '010-111', '서울'), ('b002', '관우', '국문학과', '010-111', '서울'), ('b003', '장비', '국문학과', '010-111', '서울'), ('c001', '조조', '국문학과', '016-111', '경기'), ('c002', '여포', '심리학과', '016-222', '경기'), ('c003', '동탁', '경제학과', '016-333', '경기'), ('d001', '홍길동', '수학과', '017-111', '광주'), ('S001', '박송명', '컴퓨터공학과', '123-4567', None), ('S002', '최민국', '컴퓨터공학과', '234-5678', None), ('S003', '이승호', '국문학과', '345-6789', None), ('S004', '정수봉', '국문학과', '456-7890', None), ('S005', '김상진', '국문학과', '890-5678', None), ('S006', '황정숙', '사학과', '678-9012', None))

---
### select의 내용을 dataframe으로 보기

In [22]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /opt/anaconda3/lib/python3.12/site-packages (2.0.30)
Requirement already satisfied: typing-extensions>=4.6.0 in /opt/anaconda3/lib/python3.12/site-packages (from sqlalchemy) (4.11.0)

In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
engine = create_engine("mysql+pymysql://root:qwer1234@127.0.0.1/education")
conn = engine.connect()

In [3]:
data = pd.read_sql_table('student', conn)
data

   scode sname   sdept    sphone saddress
0   b001    유비    국문학과   010-111       서울
1   b002    관우    국문학과   010-111       서울
2   b003    장비    국문학과   010-111       서울
3   c001    조조    국문학과   016-111       경기
4   c002    여포    심리학과   016-222       경기
5   c003    동탁    경제학과   016-333       경기
6   d001   홍길동     수학과   017-111       광주
7   S001   박송명  컴퓨터공학과  123-4567     None
8   S002   최민국  컴퓨터공학과  234-5678     None
9   S003   이승호    국문학과  345-6789     None
10  S004   정수봉    국문학과  456-7890     None
11  S005   김상진    국문학과  890-5678     None
12  S006   황정숙     사학과  678-9012     None

In [26]:
conn.close()

---
### dataframe을 Database로 Insert 하기

In [35]:
column = ['seq', 'title']
poem = pd.read_csv('../Data/윤동주.csv')
poem.columns = column
poem.head()

   seq         title
0    0  하늘과 바람과 별과 시
1    1            서시
2    2           자화상
3    3            소년
4    4       눈 오는 지도

In [36]:
engine = create_engine("mysql+pymysql://root:qwer1234@127.0.0.1/poem")
conn = engine.connect()

In [37]:
poem.to_sql(name='poemtable', con=engine, if_exists='append', index=False)

94

In [38]:
data = pd.read_sql_table('poemtable', conn)
data

    seq         title
0     0  하늘과 바람과 별과 시
1     1            서시
2     2           자화상
3     3            소년
4     4       눈 오는 지도
..  ...           ...
89   89     트루게네프의 언덕
90   90         달을 쏘다
91   91      별똥 떨어진 데
92   92     화원에 꽃이 핀다
93   93            종시

[94 rows x 2 columns]

---
## TinyDB
- NoSQL 문서형 데이터 베이스
- MongoDB가 대표적이지만 MongoDB는 설치가 필요하다.

In [39]:
!pip install tinydb

Collecting tinydb
  Downloading tinydb-4.8.0-py3-none-any.whl.metadata (6.2 kB)
Downloading tinydb-4.8.0-py3-none-any.whl (24 kB)
Installing collected packages: tinydb
Successfully installed tinydb-4.8.0

In [25]:
# Library
from tinydb import TinyDB, Query, where

# 데이터베이스 연결하기
filepath = "../Data/tinydb.json"
db = TinyDB(filepath)

In [26]:
# 기존에 테이블이 있다면 제거하기
db.drop_table('fruits')

In [27]:
# 테이블 생성하기
table = db.table('fruits')

In [28]:
# 테이블에 데이터 추가하기
table.insert(
    {
        'name' : 'Banana',
        'price' : 6000
    }
)
table.insert(
    {
        'name' : 'Orange',
        'price' : 12000
    }
)
table.insert(
    {
        'name' : 'Mango',
        'price' : 7000
    }
)

3

In [29]:
# 모든 테이블 추출하기
print(table.all())

[{'name': 'Banana', 'price': 6000}, {'name': 'Orange', 'price': 12000}, {'name': 'Mango', 'price': 7000}]

In [32]:
# Orange 검색하기
item = Query()
res = table.search(item.name == 'Orange')
print('orange is', res[0]['price'])

orange is 12000

In [33]:
# 수정하기
table.update({'price':8000}, item.name == "Mango")
res = table.search(item.name == 'Mango')
res

[{'name': 'Mango', 'price': 8000}]

In [34]:
# 삭제하기
table.remove(where('name') == 'Mango')
print(table.all())

[{'name': 'Banana', 'price': 6000}, {'name': 'Orange', 'price': 12000}]